# MoreThanOneAxis Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SketchFailures..::..MoreThanOneAxis Property
BuiltInFailures..::..SketchFailures Class See Also
---
More than one axes of revolution.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId MoreThanOneAxis { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MoreThanOneAxis As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ MoreThanOneAxis {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace